Tekla Open API Reference for Tekla Structures 2025
RebarMesh.CutByFatherPartCuts Property
 Defines whether the rebar mesh is cut by father part cuts or not.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool CutByFatherPartCuts { get; set; }
Public Property CutByFatherPartCuts As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RebarMesh Class
Tekla.Structures.Model Namespace